In [27]:
import pandas as pd
import numpy as np

In [28]:
df = pd.read_csv("mldata.csv")
df

     age  weight  gender likeness   height
0     27    76.0    Male  Biryani  170.688
1     41    70.0    Male  Biryani      165
2     29    80.0    Male  Biryani      171
3     27   102.0    Male  Biryani      173
4     29    67.0    Male  Biryani      164
..   ...     ...     ...      ...      ...
240   31    60.0    Male   Pakora      160
241   26    70.0    Male  Biryani      172
242   40    80.0    Male  Biryani      178
243   25    65.0    Male  Biryani      5.7
244   33    56.0  Female   Samosa      157

[245 rows x 5 columns]

In [29]:
df.head()

   age  weight gender likeness   height
0   27    76.0   Male  Biryani  170.688
1   41    70.0   Male  Biryani      165
2   29    80.0   Male  Biryani      171
3   27   102.0   Male  Biryani      173
4   29    67.0   Male  Biryani      164

In [30]:
df['gender'] = df['gender'].replace("Male", 1)
df['gender'] = df['gender'].replace("Female",0)

df.head()

   age  weight  gender likeness   height
0   27    76.0       1  Biryani  170.688
1   41    70.0       1  Biryani      165
2   29    80.0       1  Biryani      171
3   27   102.0       1  Biryani      173
4   29    67.0       1  Biryani      164

In [31]:
df.tail()

     age  weight  gender likeness height
240   31    60.0       1   Pakora    160
241   26    70.0       1  Biryani    172
242   40    80.0       1  Biryani    178
243   25    65.0       1  Biryani    5.7
244   33    56.0       0   Samosa    157

In [33]:
  # Selection of input and output variables
X = df[['weight','gender']]
y = df['likeness']

In [34]:
X.head()

   weight  gender
0    76.0       1
1    70.0       1
2    80.0       1
3   102.0       1
4    67.0       1

In [35]:
y.head()

0    Biryani
1    Biryani
2    Biryani
3    Biryani
4    Biryani
Name: likeness, dtype: object

In [36]:
# Machine Learning Algorithm
from sklearn.tree import DecisionTreeClassifier

# Create and fit model
model = DecisionTreeClassifier().fit(X,y)

In [38]:
# Prediction
model.predict([[80,1]])

C:\Users\Dell\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array(['Biryani'], dtype=object)

In [39]:
model.predict([[23,0]])

C:\Users\Dell\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array(['Biryani'], dtype=object)

In [42]:
# Check accuracy we split data into test and trian (80/20)
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [65]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size = 0.2, random_state= 0)

In [66]:
# create a model
model = DecisionTreeClassifier()
#Fitting a model
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [67]:
predicted_values = model.predict(X_test)
predicted_values

array(['Biryani', 'Biryani', 'Pakora', 'Biryani', 'Samosa', 'Biryani',
       'Pakora', 'Biryani', 'Biryani', 'Biryani', 'Samosa', 'Samosa',
       'Samosa', 'Pakora', 'Biryani', 'Biryani', 'Biryani', 'Biryani',
       'Biryani', 'Pakora', 'Biryani', 'Biryani', 'Biryani', 'Biryani',
       'Biryani', 'Biryani', 'Biryani', 'Samosa', 'Biryani', 'Samosa',
       'Biryani', 'Biryani', 'Biryani', 'Biryani', 'Biryani', 'Biryani',
       'Biryani', 'Biryani', 'Samosa', 'Biryani', 'Biryani', 'Biryani',
       'Biryani', 'Biryani', 'Biryani', 'Biryani', 'Biryani', 'Biryani',
       'Biryani'], dtype=object)

In [68]:
# Checking Score
score = accuracy_score(y_test, predicted_values)
score

0.6122448979591837

# How to train and save your model

In [69]:
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
import joblib

model = DecisionTreeClassifier().fit(X,y)
joblib.dump(model, "foodie.joblib")

['foodie.joblib']

# How to run a stored or save model on our data?

In [72]:
loaded_model = joblib.load(open('foodie.joblib', 'rb'))

In [74]:
result = loaded_model.score(X_test, y_test)
print(result)

0.7959183673469388

In [75]:
from sklearn import tree
model = DecisionTreeClassifier().fit(X,y)
# Graphic evaluation/ look in to what happened

tree.export_graphviz(model, out_file = "foodie.dot", feature_names=['age', 'gender'], class_names=sorted(y.unique()),
                    label = 'all', rounded = True, filled = True)

In [76]:
df.head()

   age  weight  gender likeness   height
0   27    76.0       1  Biryani  170.688
1   41    70.0       1  Biryani      165
2   29    80.0       1  Biryani      171
3   27   102.0       1  Biryani      173
4   29    67.0       1  Biryani      164

In [77]:
df.tail()

     age  weight  gender likeness height
240   31    60.0       1   Pakora    160
241   26    70.0       1  Biryani    172
242   40    80.0       1  Biryani    178
243   25    65.0       1  Biryani    5.7
244   33    56.0       0   Samosa    157

In [78]:
df

     age  weight  gender likeness   height
0     27    76.0       1  Biryani  170.688
1     41    70.0       1  Biryani      165
2     29    80.0       1  Biryani      171
3     27   102.0       1  Biryani      173
4     29    67.0       1  Biryani      164
..   ...     ...     ...      ...      ...
240   31    60.0       1   Pakora      160
241   26    70.0       1  Biryani      172
242   40    80.0       1  Biryani      178
243   25    65.0       1  Biryani      5.7
244   33    56.0       0   Samosa      157

[245 rows x 5 columns]